In [2]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
       index=['cobra', 'viper', 'sidewinder'],
       columns=['max_speed', 'shield'])

In [3]:
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [4]:
df.loc[['viper', 'sidewinder']]

            max_speed  shield
viper               4       5
sidewinder          7       8

In [5]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
           {'a': 100, 'b': 200, 'c': 300, 'd': 400},
           {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
df = pd.DataFrame(mydict)

In [6]:
df.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [7]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [8]:
df.iloc[[0, 1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [14]:
df.iloc[:3]

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [10]:
df.iloc[lambda x: x.index % 2 == 0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [18]:
df = pd.DataFrame({'A': range(1, 6),
                    'B': range(10, 0, -2),
                    'C': range(10, 5, -1)})
print(df.query('A > B'))
print(df.query('B == C'))
print(df[df.A > df.B])

df

   A  B  C
4  5  2  6
   A   B   C
0  1  10  10
   A  B  C
4  5  2  6

   A   B   C
0  1  10  10
1  2   8   9
2  3   6   8
3  4   4   7
4  5   2   6

In [19]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                     'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                     'value': [5, 6, 7, 8]})
print(df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=("_left","_right")))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  bar           2  bar            6
3  baz           3  baz            7
4  foo           5  foo            5
5  foo           5  foo            8

In [20]:
df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                    'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                       'B': ['B0', 'B1', 'B2']})
df.join(other, lsuffix='_caller', rsuffix='_other')

  key_caller   A key_other    B
0         K0  A0        K0   B0
1         K1  A1        K1   B1
2         K2  A2        K2   B2
3         K3  A3       NaN  NaN
4         K4  A4       NaN  NaN
5         K5  A5       NaN  NaN

In [25]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                               'Parrot', 'Parrot'],
                    'Max Speed': [380., 370., 24., 26.]})

df

grouped = df.groupby(['Animal'])
grouped.mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [36]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df.apply(np.sqrt)
df['A'] = df.apply(lambda x: x['A']+1, axis=1)
df['C'] = df.apply(lambda x: x['A']+x['B'], axis=1)

df

   A  B   C
0  5  9  14
1  5  9  14
2  5  9  14

In [3]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'], 'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'], 'value': [5, 6, 7, 8]})
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  bar        2  bar        6
3  baz        3  baz        7
4  foo        5  foo        5
5  foo        5  foo        8